Classes | Enumerations | Functions
Analytical Model
Functions related to the Analytical Model. More...
 Classes
class  | API_InternalAnalyticalMemberPartId
Describes a Structural Analytical Model Analytical Member part. More...
struct  | API_AMPartRefCustomVertexData
Describes a vertex when the analytical member part has custom vertex type. More...
struct  | API_AMPartRefRatioEdgeData
Describes the ratios when the analytical member part has ratio edge type. More...
struct  | API_AnalyticalMemberPartRef
Describes a Structural Analytical Model Analytical Member part. More...
struct  | API_AnalyticalSupport_SupportValues
Contains the Structural Analytical Model Analytical Support values. More...
struct  | API_AnalyticalSupport_Settings
Describes the Structural Analytical Model Analytical Support settings. More...
struct  | API_AnalyticalSupportType
Describes a Structural Analytical Model Member Support. More...
struct  | API_AnalyticalSupportGeometry
Describes a Structural Analytical Model Analytical Support Geometry. More...
struct  | API_AnalyticalLink_Translation
Describe the translation of an analitycal link. More...
struct  | API_AnalyticalLink_Rotation
Contains the Structural Analytical Model Analytical Link Rotation values. More...
struct  | API_AnalyticalLink_RigidSettings
Describes the rigidity settings on both sides of the Structural Analytical Model Analytical Link element. More...
struct  | API_AnalyticalLink_SpringSettings
Describes the spring settings of the Structural Analytical Model Analytical Link element. More...
struct  | API_AnalyticalLink_Settings
Describes the Structural Analytical Model Analytical Link settings. More...
struct  | API_AnalyticalLinkType
Describes a Structural Analytical Model Analytical Link. More...
struct  | API_AnalyticalLinkGeometry
Describes a Structural Analytical Model Analytical Link Geometry. More...
struct  | API_AnalyticalPointLoad_Settings
Describes the Structural Analytical Model Analytical Point Load settings. More...
struct  | API_AnalyticalPointLoadType
Describes a Structural Analytical Model Member Point Load. More...
struct  | API_AnalyticalPointLoadGeometry
Describes a Structural Analytical Model Analytical Point Load Geometry. More...
struct  | API_AnalyticalEdgeLoad_Settings
Describes the Structural Analytical Model Analytical Edge Load settings. More...
struct  | API_AnalyticalEdgeLoadType
Describes a Structural Analytical Model Member Edge Load. More...
struct  | API_AnalyticalSurfaceLoad_Settings
Describes the Structural Analytical Model Analytical Surface Load settings. More...
struct  | API_AnalyticalSurfaceLoadType
Describes a Structural Analytical Model Member Surface Load. More...
struct  | API_EdgeLoadCustomData
Describes a Structural Analytical Model Analytical Edge Load Geometry. More...
struct  | API_AnalyticalModelVariation
Describes the Model Variation that is used for creating the Structural Analytical Model. More...
struct  | API_AnalyticalCrossSection
Describes or references an Structural Analytical Model Cross Section for Curve Members. More...
struct  | API_AnalyticalVaryingSegment
Describes a Structural Analytical Model Varying Segment for Curve Members. More...
struct  | API_AnalyticalCurveMember
Describes an Structural Analytical Model Curve Member. More...
struct  | API_AnalyticalPlaneSurface
TBD. More...
struct  | API_AnalyticalCylinderSurface
TBD. More...
struct  | API_AnalyticalSurface
Describes the Structural Analytical Model Surface of a Structural Analytical Model Surface Member. More...
struct  | API_AnalyticalSurfaceMember
Describes a Structural Analytical Model Surface Member. More...
struct  | API_CoordinateSystem
Describes a coordinate system. More...
class  | API_AnalyticalElemPartId
Describes the guid, contour and edge/vertex id triplet that is used for creating the API_ExportIdMappingType. More...
struct  | API_ExportIdMappingType
Describes the connection between the unsegmented surface member's and the created segment's edges and vertices. More...
struct  | API_ImportIdMappingType
Describes the connection between the (un)segmented surface segments and the created member's edges and vertices. More...
struct  | API_AnalyticalReleaseDescription
Contains the Structural Analytical Model Analytical Member Release values. More...
struct  | API_AnalyticalReleaseType
Describes a Structural Analytical Model Member release. More...
struct  | API_AnalyticalLoadCase
Describes a Structural Analytical Load Case. More...
struct  | API_AnalyticalLoadGroup
Describes a Structural Analytical Load Group. More...
struct  | API_AnalyticalLoadFactor
Describes how a Load Case belongs to a Load Combination. More...
struct  | API_AnalyticalLoadCombination
Describes a Structural Analytical Load Combination. More...
struct  | API_AM_VisibilitySettings
Describes the Analytical Model Visiblity Settings. More...
 Enumerations
enum  | API_AnalyticalMemberPartRefType : UInt16 {
 API_AMPartRef_BegVertex = 1 , API_AMPartRef_BegVertex = 1 , API_AMPartRef_EndVertex = 2 , API_AMPartRef_EndVertex = 2 ,
 API_AMPartRef_CustomVertex = 3 , API_AMPartRef_CustomVertex = 3 , API_AMPartRef_Edge = 4 , API_AMPartRef_Edge = 4 ,
 API_AMPartRef_RatioEdge = 5 , API_AMPartRef_RatioEdge = 5 , API_AMPartRef_Surface = 6 , API_AMPartRef_Surface = 6 ,
 API_AMPartRef_CustomSurface = 7 , API_AMPartRef_CustomSurface = 7 , API_AMPartRef_CustomEdge = 8 , API_AMPartRef_CustomEdge = 8
 }
Describes the type of the Structural Analytical Model Member Part Ref. More...
enum  | API_AnalyticalCoordSysDirection : UInt16 { API_Global = 1 , API_Global = 1 , API_Local = 2 , API_Local = 2 }
Describes the type of the Structural Analytical Model coordinate system. More...
enum  | API_AnalyticalRigidityType : UInt16 {
 API_FreeType = 1 , API_FreeType = 1 , API_RigidType = 2 , API_RigidType = 2 ,
 API_CustomType = 3 , API_CustomType = 3 , API_RigidCompressionOnlyType = 4 , API_RigidCompressionOnlyType = 4 ,
 API_RigidTensionOnlyType = 5 , API_RigidTensionOnlyType = 5 , API_CustomCompressionOnlyType = 6 , API_CustomCompressionOnlyType = 6 ,
 API_CustomTensionOnlyType = 7 , API_CustomTensionOnlyType = 7
 }
Describes the type of the Structural Analytical Model rigidity class type. More...
enum  | API_AnalyticalSupport_SupportType : UInt16 {
 API_SimplePoint = 1 , API_SimplePoint = 1 , API_SingleLine = 2 , API_SingleLine = 2 ,
 API_Surface = 3 , API_Surface = 3
 }
Describes the type of the Structural Analytical Model Analytical Support type. More...
enum  | API_AnalyticalLink_LinkType : UInt16 { API_Rigid = 1 , API_Rigid = 1 , API_Spring = 2 , API_Spring = 2 }
Describes the type of the Structural Analytical Model Analytical Link. More...
enum  | API_AnalyticalLink_LinkGeometry : UInt16 { API_Link1D = 1 , API_Link1D = 1 , API_Link2D = 2 , API_Link2D = 2 }
Describes the geometry of the Structural Analytical Model Analytical Link. More...
enum  | API_AnalyticalLink_RigidLinkConnectionType : UInt16 { API_RigidConnection = 1 , API_RigidConnection = 1 , API_HingeConnection = 2 , API_HingeConnection = 2 }
Describes the type of the Structural Analytical Model Analytical Rigid Link connection. More...
enum  | API_AnalyticalLoad_LoadDistributionType : UInt16 { API_Uniform = 1 , API_Uniform = 1 , API_Trapezoid = 2 , API_Trapezoid = 2 }
Describes the distribution type of the Structural Analytical Edge Load. The load may be either constant along the 1D member or linearly variable (trapezoidal). More...
enum class  | API_AnalyticalMemberType : UInt16 {
 Unknown , Beam , Column , Roof ,
 Slab , Wall
 }
Describes the Structural Analytical Model Member type. More...
enum class  | API_AnalyticalAlignmentType {
 TopLeft , Top , TopRight , Left ,
 Center , Right , BottomLeft , Bottom ,
 BottomRight , None
 }
Describes the alignment of a Cross Section. More...
enum  | API_AnalyticalSurfaceType { API_AnalyticalSurface_PlaneType , API_AnalyticalSurface_CylinderType }
Describes the Structural Analytical Model Surface type. More...
enum  | API_AnalyticalLoadCaseActionType { API_AnalyticalLoadCase_PermanentAction , API_AnalyticalLoadCase_VariableAction , API_AnalyticalLoadCase_AccidentalAction }
Describes the Structural Analytical Load Case Action type. More...
enum  | API_AnalyticalLoadCaseLoadType {
 API_AnalyticalLoadCase_SelfWeightLoad , API_AnalyticalLoadCase_PrestressLoad , API_AnalyticalLoadCase_DynamicLoad , API_AnalyticalLoadCase_StaticLoad ,
 API_AnalyticalLoadCase_TemperatureLoad , API_AnalyticalLoadCase_WindLoad , API_AnalyticalLoadCase_SnowLoad , API_AnalyticalLoadCase_MaintenanceLoad ,
 API_AnalyticalLoadCase_FireLoad , API_AnalyticalLoadCase_MovingLoad , API_AnalyticalLoadCase_SeismicLoad , API_AnalyticalLoadCase_StandardLoad ,
 API_AnalyticalLoadCase_OthersLoad
 }
Describes the Structural Analytical Load Case Load type. More...
enum  | API_AnalyticalLoadCaseDuration { API_AnalyticalLoadCase_LongDuration , API_AnalyticalLoadCase_MediumDuration , API_AnalyticalLoadCase_ShortDuration , API_AnalyticalLoadCase_InstantaneousDuration }
Describes the Structural Analytical Load Case duration. More...
enum  | API_AnalyticalLoadGroupType {
 API_AnalyticalLoadGroup_PermanentLoad , API_AnalyticalLoadGroup_VariableLoad , API_AnalyticalLoadGroup_AccidentalLoad , API_AnalyticalLoadGroup_SeismicLoad ,
 API_AnalyticalLoadGroup_MovingLoad , API_AnalyticalLoadGroup_TensioningLoad , API_AnalyticalLoadGroup_FireLoad
 }
Describes the Structural Analytical Load Group type. More...
enum  | API_AnalyticalLoadGroupRelation { API_AnalyticalLoadGroup_ExclusiveRelation , API_AnalyticalLoadGroup_StandardRelation , API_AnalyticalLoadGroup_TogetherRelation }
Describes the relation of load cases in the particular load group. More...
enum  | API_AnalyticalLoadCombinationCategory {
 API_AnalyticalLoadCombination_ULS , API_AnalyticalLoadCombination_SLS , API_AnalyticalLoadCombination_ALS , API_AnalyticalLoadCombination_ANS ,
 API_AnalyticalLoadCombination_NotDefined
 }
Describes the category of the Structural Analytical Load Combination. More...
enum class  | API_AM_VisibilityMode { AnalyticalModelOnly , AnalyticalModelWithinEntireModel }
Describes the Analytical Model Visiblity Mode. More...
enum class  | API_LoadVisibilityMode { API_LoadVisibilityMode_FilterByActive , API_LoadVisibilityMode_HideAll , API_LoadVisibilityMode_ShowAll }
Describes the Load Visiblity Mode. More...
 Functions
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetCurrentAnalyticalModel (API_Guid &amGuid)
Returns the Structural Analytical Model created for the current view.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_UpdateAnalyticalModel (const API_Guid &amGuid)
Triggers an update of the Structural Analytical Model specified.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalModelVariation (const API_Guid &amGuid, API_AnalyticalModelVariation &api_modelVariation)
Returns the Model Variation used for creating the specified Structural Analytical Model.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalModel (const API_AnalyticalModelVariation &api_modelVariation, API_Guid &amGuid)
Returns the Structural Analytical Model created for the specified Model Variation.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetGenerationSettingsToNoRule ()
Sets the current analytical model's generation settings to no rules.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetVisibilitySettings (API_AM_VisibilitySettings &api_am_visiblitySettings)
Returns the Visibility Settings of the analytical model.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetVisibilitySettings (const API_AM_VisibilitySettings &api_am_visiblitySettings)
Sets the Visibility Settings of the analytical model.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalRelease (const API_Guid &amGuid, const API_Guid &elemGuid, API_AnalyticalReleaseType &api_analyticalRelease)
Returns the Structural Analytical Model Member Relase associated with the selected Curve Element.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetAnalyticalRelease (const API_Guid &elemGuid, const API_AnalyticalReleaseType &api_analyticalRelease)
Sets the Structural Analytical Model Member Release to the selected Curve Element.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetCurveElements (const API_Guid &amGuid, GS::Array< API_Guid > &curveElements)
Returns the elements that have Structural Analytical Model Curve Member associated.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetCurveMember (const API_Guid &amGuid, const API_Guid &elemGuid, API_AnalyticalCurveMember &cm)
Returns the Structural Analytical Model Curve Member associated with the selected Curve Element.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetSurfaceElements (const API_Guid &amGuid, GS::Array< API_Guid > &surfaceElements)
Returns the elements that have Structural Analytical Model Surface Member associated.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetSurfaceMember (const API_Guid &amGuid, const API_Guid &elemGuid, API_AnalyticalSurfaceMember &surfaceMember, API_ExportIdMappingType &idMapping)
Returns the Structural Analytical Model Surface Member associated with the selected Surface Element.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetSegmentedSurfaceMember (const API_Guid &amGuid, const API_Guid &elemGuid, GS::Array< API_AnalyticalSurfaceMember > &surfaceMember, double centralAngle, API_ExportIdMappingType &surfaceIdMapping)
Returns the Structural Analytical Model Surface Member segmented version associated with the selected Surface Element.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_CreateElementFromCurveMember (API_AnalyticalCurveMember &api_curveMember, const GS::Optional< GS::UniString > &favoriteName)
Creates an element from the Structural Analytical Model Curve Member.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_CreateElementFromSurfaceMember (API_AnalyticalSurfaceMember &api_surfaceMember, const GS::Optional< GS::UniString > &favoriteName, API_ImportIdMappingType *idMapping)
Creates an element from the Structural Analytical Model Surface Member.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_CreateElementFromSegmentedSurfaceMember (GS::Array< API_AnalyticalSurfaceMember > &api_surfaceMember, const GS::Optional< GS::UniString > &favoriteName, API_ImportIdMappingType *idMapping)
Creates an element from the Structural Analytical Model Surface Member segments.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetLCSOfAnalyticalMember (const API_AnalyticalMemberPartRef &analyticalMemberPartRef, API_CoordinateSystem &coordinateSystem)
Get the local coordinate system of a member from AnalyticalMemberPartRef.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetLCSOfAnalyticalMemberInIntersection (const API_AnalyticalMemberPartRef &firstAnalyticalMemberPartRef, const API_AnalyticalMemberPartRef &secondAnalyticalMemberPartRef, API_CoordinateSystem &coordinateSystem)
Get the local coordinate system of a member in intersection of AnalyticalMemberPartRefs.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalMemberConnections (const API_Guid &amGuid, const API_Guid &elemGuid, GS::HashSet< API_Guid > &api_connections)
Returns the guids of elements which are connected to a Structural Analytical Member, given by it's guid. Includes elements which are connected by Structural Analytical Links.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalMemberPartRefCoord (const API_Guid &amGuid, const API_AnalyticalMemberPartRef &api_memberPartRef, API_AnalyticalNode &api_analyticalNode)
Returns the coord of the given Structural Analytical Model's Analytical Member part if it identifies an edge.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalMemberPartRefCurve (const API_Guid &amGuid, const API_AnalyticalMemberPartRef &api_memberPartRef, API_AnalyticalCurve &api_analyticalCurve)
Returns the curve of the given Structural Analytical Model's Analytical Member part if it identifies a vertex.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetComplementaryProjectMemberType (const API_Guid &elemGuid, API_AnalyticalMemberType &analyticalMemberType)
Returns the Analytical Member Type of a certain element from the Complementary Project.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetElementFromLink (const API_AnalyticalLinkType &link, API_Element &element)
Sets element.type to API_AnalyticalLinkID , and element.externalElemData to link .
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetLinkFromElement (const API_Element &element, API_AnalyticalLinkType &link)
Obtains the API_AnalyticalLinkType from.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalLinkGeometry (const API_Guid &amGuid, const API_Guid &elemGuid, API_AnalyticalLinkGeometry &api_analyticalLinkGeometry)
Returns the Structural Analytical Link Geometry.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_ConvertAnalyticalLinkToNonShortest (const API_Guid &amGuid, const API_Guid &elemGuid, API_AnalyticalLinkType &api_analyticalLink)
Converts an Analytical Link that is associative to a Curve Member or an edge of a Surface Member (known as a "shortest" Analytical Link) to an Analytical Link that is connected to a fixed coordinate.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetElementFromSupport (const API_AnalyticalSupportType &support, API_Element &element)
Sets element.type to API_AnalyticalSupportID , and element.externalElemData to support .
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetSupportFromElement (const API_Element &element, API_AnalyticalSupportType &support)
Obtains the API_AnalyticalSupportType from element , if it is a valid API_AnalyticalSupportType .
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalSupportGeometry (const API_Guid &amGuid, const API_Guid &elemGuid, API_AnalyticalSupportGeometry &api_analyticalSupportGeometry)
Returns the Structural AnalyticalSupport Geometry.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetElementFromPointLoad (const API_AnalyticalPointLoadType &pointLoad, API_Element &element)
Sets element.type to API_AnalyticalPointLoadID , and element.externalElemData to pointLoad .
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetPointLoadFromElement (const API_Element &element, API_AnalyticalPointLoadType &pointLoad)
Obtains the API_AnalyticalPointLoadType from element , if it is a valid API_AnalyticalPointLoadType .
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalPointLoadGeometry (const API_Guid &amGuid, const API_Guid &elemGuid, API_AnalyticalPointLoadGeometry &api_analyticalPointLoadGeometry)
Returns the Structural Analytical Point Load Geometry.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetElementFromEdgeLoad (const API_AnalyticalEdgeLoadType &edgeLoad, API_Element &element)
Sets element.type to API_AnalyticalEdgeLoadID , and element.externalElemData to edgeLoad .
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetEdgeLoadFromElement (const API_Element &element, API_AnalyticalEdgeLoadType &edgeLoad)
Obtains the API_AnalyticalEdgeLoadType from element , if it is a valid API_AnalyticalEdgeLoadType .
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetEdgeLoadGeometry (const API_Guid &amGuid, const API_Guid &elemGuid, API_EdgeLoadCustomData &edgeLoadCustomData)
Returns the Structural Analytical Model's Analytical Edge Load Geometry.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetMemoFromEdgeLoadCustomData (const API_EdgeLoadCustomData &edgeLoadCustomData, API_ElementMemo &memo)
Set Structural Analytical Model's Analytical Edge Load Geometry in the given memo.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetEdgeLoadCustomDataFromMemo (const API_ElementMemo &memo, API_EdgeLoadCustomData &edgeLoadCustomData)
Get Structural Analytical Model's Analytical Edge Load Geometry from the given memo.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetElementFromSurfaceLoad (const API_AnalyticalSurfaceLoadType &surfaceLoad, API_Element &element)
Sets element.type to API_AnalyticalSurfaceLoadID , and element.externalElemData to surfaceLoad .
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetSurfaceLoadFromElement (const API_Element &element, API_AnalyticalSurfaceLoadType &surfaceLoad)
Obtains the API_AnalyticalSurfaceLoadType from element , if it is a valid API_AnalyticalSurfaceLoadType .
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetSurfaceLoadGeometry (const API_Guid &amGuid, const API_Guid &elemGuid, API_SurfaceLoadCustomData &edgeLoadCustomData)
Returns the Structural Analytical Model's Custom Surface Coordinates for Surface Load.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetMemoFromSurfaceLoadCustomData (const API_SurfaceLoadCustomData &customData, API_ElementMemo &memo)
Set Structural Analytical Model's Custom Surface Coordinates for Surface Load in the given memo.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_SetSurfaceLoadCustomDataFromMemo (const API_ElementMemo &memo, API_SurfaceLoadCustomData &customData)
Get Structural Analytical Model's Custom Surface Coordinates for Surface Load from the given memo.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalLoadGroups (GS::Array< API_Guid > &analyticalLoadGroups)
Returns an array of unique identifiers of the existing Load Groups.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalLoadGroup (const API_Guid &analyticalLoadGroupGuid, API_AnalyticalLoadGroup &analyticalLoadGroup)
Returns the Load Group with the given unique identifier.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_CreateAnalyticalLoadGroup (API_AnalyticalLoadGroup &analyticalLoadGroup)
Creates an Analytical Load Group.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_DeleteAnalyticalLoadGroup (const API_Guid &analyticalLoadGroupGuid)
Deletes an Analytical Load Group.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAllAnalyticalLoadCases (GS::Array< API_Guid > &analyticalLoadCases)
Returns an array of unique identifiers of all the existing Load Cases from every Load Group.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalLoadCases (const API_Guid &analyticalLoadGroupGuid, GS::Array< API_Guid > &analyticalLoadCases)
Returns an array of unique identifiers of the existing Load Cases from a Load Group.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalLoadCase (const API_Guid &analyticalLoadCaseGuid, API_AnalyticalLoadCase &analyticalLoadCase)
Returns the Load Case with the given unique identifier.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_CreateAnalyticalLoadCase (API_AnalyticalLoadCase &analyticalLoadCase)
Creates an Analytical Load Group.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_DeleteAnalyticalLoadCase (const API_Guid &analyticalLoadCaseGuid)
Deletes an Analytical Load Group.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalLoadCombinations (GS::Array< API_Guid > &analyticalLoadCombinations)
Returns an array of unique identifiers of the existing Load Combinations.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_GetAnalyticalLoadCombination (const API_Guid &analyticalLoadCombinationGuid, API_AnalyticalLoadCombination &analyticalLoadCombination)
Returns the Load Combination with the given unique identifier.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_CreateAnalyticalLoadCombination (API_AnalyticalLoadCombination &analyticalLoadCombination)
Creates an Analytical Load Combination.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_AddLoadCaseToLoadCombination (const API_AnalyticalLoadFactor &loadFactor, const API_Guid &analyticalLoadCombinationGuid)
Adds a Load Case (with its adherent coefficients) to a Load Combination identified with guid.
GSErrCode __ACENV_CALL  | ACAPI_Analytical_DeleteAnalyticalLoadCombination (const API_Guid &analyticalLoadCombinationGuid)
Deletes an Analytical Load Combination.
Detailed Description
Functions related to the Analytical Model.
 Analytical Model
Archicad generates an Analytical Model for the cores of all load-bearing elements. The generation depends on the 3D model of the cores and the Analytical Model generation rules. The 3D models of the cores of the physical elements are checked to see if they are connected.
The 3D connection is governed by the renovation filter and the layer connection class IDs, where it can be customized which layers should interact with each other. The special layer connection class ID of 0 means that the elements shouldn't interact with any other element.
The Analytical Model Generation Rules can be customized to fit the plan's needs. These rules are part of the plan database, so it can be saved with the plan and it is common for all users joined in the same Teamwork project. The rules can also be saved as part of a template.
An Analytical Model variation (API_AnalyticalModelVariation) is defined by these settings. This makes the Analytical Model view-dependant. E.g. a view that shows the existing building with the elements to be destroyed during the renovation will have a different Analytical Model than the one showing the remaining elements toghether with the new ones. Some analytical members might even be adjusted differently even if they exist in both variations, giving it different eccentricity in each model.
After defining the needed variation you can query the corresponding Analytical Model using the ACAPI_Analytical_GetAnalyticalModel function. The ACAPI_Analytical_GetCurrentAnalyticalModel function can be used to get the one corresponding to the current view.
In Archicad the Analytical Model generation is done only when it is needed (e.g. when it is visible in the active view). To ensure that the latest data is available from an Analytical Model it can be updated using the ACAPI_Analytical_UpdateAnalyticalModel function.
 Analytical Members
As the Analytical Model is generated, there is no way on the API to directly create analytical members, since even in Archicad the members are calculated and can't exist on their own. A physical element can be created based on a specified analytical member. The element will be created without any generation rules or connection to another element, the analytical member generated from this element should be identical to the specified one. However this can't be guaranteed because it might be affected by the connections or the rules.
The API provides methods to create elements based on curve or surface members. The actual physical element's type will be decided by Archicad based on the limitations of the tools and tries to match with the most likely uses.
The following functions can be used to create elements based on analytical members:
ACAPI_Analytical_CreateElementFromCurveMember : create a model element based on a curve member.
ACAPI_Analytical_CreateElementFromSurfaceMember : create a model element based on a surface member.
ACAPI_Analytical_CreateElementFromSegmentedSurfaceMember : create a model element based on segmented surface member (multiple members assumed to be parts of one arced member).
 Analytical Releases
The analytical members may connect to each other. This is visualized in Archicad by having green nodes where the two members connect. By default such connections are set to be fully rigid. The behaviour of an element's member when connected to another member can be customized via the release properties of the element. The structure API_AnalyticalReleaseType can be used to describe the release properties.
An element's release properties are valid even if no other member is connected to it. There is even a special generation setting that can automatically reset release properties to rigid where there is no connection to another member.
An Analytical Release is always defined for a specific part of an element that is described by the API_AnalyticalMemberPartRef structure.
 Analytical Links
When two members are not connected after applying the generation rules, but they should be connected in the Structural Analytical Model it is possible to use a tool called Analytical Link to connect them in Archicad.
An Analytical Link can be one-dimensional or a surface. A specific case of the one-dimensional link is the so-called "zero-length" link, this means the two members it connects have an intersection and the link is connected to this point on both members.
Either end of the link can be connected to a vertex of a curve or surface member, a curve member, the edge of a surface member, the face of a surface member or a specific non-predefined point of any member.
The links being connected to the members means that if the geometry or position of the members changes then so will that of the link(s) connecting them.
On the API the Analytical Link is defined in the API_Element as API_AnalyticalLinkType. You can define the members the link is connected to with the API_AnalyticalMemberPartRef.
The API can directly create an Analytical Link from the API_AnalyticalLinkType using ACAPI_Element_Create.
 Analytical Supports
The Analytical Support represents the connection of the Structural Analytical Model to the outside world. A support can be placed on a vertex of a curve or surface member, on the edge of a surface member, along the line of a curve member or on the face of a surface member.
On the API the Analytical Support is defined in the API_Element as API_AnalyticalSupportType. You can define the member the support is connected to with the API_AnalyticalMemberPartRef.
The API can directly create an Analytical Support from the API_AnalyticalSupportType using ACAPI_Element_Create.
Enumeration Type Documentation
◆ API_AM_VisibilityMode
 enum class API_AM_VisibilityMode
strong
Describes the Analytical Model Visiblity Mode.
Since
Archicad 26
◆ API_AnalyticalAlignmentType
 enum class API_AnalyticalAlignmentType
strong
Describes the alignment of a Cross Section.
Since
Archicad 26
◆ API_AnalyticalCoordSysDirection
 enum API_AnalyticalCoordSysDirection : UInt16
Describes the type of the Structural Analytical Model coordinate system.
Since
Archicad 25
◆ API_AnalyticalLink_LinkGeometry
 enum API_AnalyticalLink_LinkGeometry : UInt16
Describes the geometry of the Structural Analytical Model Analytical Link.
Since
Archicad 25
◆ API_AnalyticalLink_LinkType
 enum API_AnalyticalLink_LinkType : UInt16
Describes the type of the Structural Analytical Model Analytical Link.
Since
Archicad 25
◆ API_AnalyticalLink_RigidLinkConnectionType
 enum API_AnalyticalLink_RigidLinkConnectionType : UInt16
Describes the type of the Structural Analytical Model Analytical Rigid Link connection.
Since
Archicad 25
◆ API_AnalyticalLoad_LoadDistributionType
 enum API_AnalyticalLoad_LoadDistributionType : UInt16
Describes the distribution type of the Structural Analytical Edge Load. The load may be either constant along the 1D member or linearly variable (trapezoidal).
Since
Archicad 25
◆ API_AnalyticalLoadCaseActionType
 enum API_AnalyticalLoadCaseActionType
Describes the Structural Analytical Load Case Action type.
Since
Archicad 25
◆ API_AnalyticalLoadCaseDuration
 enum API_AnalyticalLoadCaseDuration
Describes the Structural Analytical Load Case duration.
Since
Archicad 25
◆ API_AnalyticalLoadCaseLoadType
 enum API_AnalyticalLoadCaseLoadType
Describes the Structural Analytical Load Case Load type.
Since
Archicad 25
◆ API_AnalyticalLoadCombinationCategory
 enum API_AnalyticalLoadCombinationCategory
Describes the category of the Structural Analytical Load Combination.
Since
Archicad 25
◆ API_AnalyticalLoadGroupRelation
 enum API_AnalyticalLoadGroupRelation
Describes the relation of load cases in the particular load group.
Since
Archicad 25
◆ API_AnalyticalLoadGroupType
 enum API_AnalyticalLoadGroupType
Describes the Structural Analytical Load Group type.
Since
Archicad 25
◆ API_AnalyticalMemberPartRefType
 enum API_AnalyticalMemberPartRefType : UInt16
Describes the type of the Structural Analytical Model Member Part Ref.
Since
Archicad 25
◆ API_AnalyticalMemberType
 enum class API_AnalyticalMemberType : UInt16
strong
Describes the Structural Analytical Model Member type.
Since
Archicad 25
◆ API_AnalyticalRigidityType
 enum API_AnalyticalRigidityType : UInt16
Describes the type of the Structural Analytical Model rigidity class type.
Since
Archicad 25
◆ API_AnalyticalSupport_SupportType
 enum API_AnalyticalSupport_SupportType : UInt16
Describes the type of the Structural Analytical Model Analytical Support type.
Since
Archicad 25
◆ API_AnalyticalSurfaceType
 enum API_AnalyticalSurfaceType
Describes the Structural Analytical Model Surface type.
Since
Archicad 24
◆ API_LoadVisibilityMode
 enum class API_LoadVisibilityMode
strong
Describes the Load Visiblity Mode.
Since
Archicad 26
Function Documentation
◆ ACAPI_Analytical_AddLoadCaseToLoadCombination()
 GSErrCode __ACENV_CALL ACAPI_Analytical_AddLoadCaseToLoadCombination  |  ( |  const API_AnalyticalLoadFactor &  |  loadFactor,
|  const API_Guid &  |  analyticalLoadCombinationGuid
)
inline
Adds a Load Case (with its adherent coefficients) to a Load Combination identified with guid.
Since
Archicad 26
Parameters
loadFactor | [in] Analytical Load Factor (load case guid, load factor and multiplier) which will be added to the Load combination.
analyticalLoadCombinationGuid | [in] Unique identifier of the Load combination.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_ConvertAnalyticalLinkToNonShortest()
 GSErrCode __ACENV_CALL ACAPI_Analytical_ConvertAnalyticalLinkToNonShortest  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  API_AnalyticalLinkType &  |  api_analyticalLink
)
inline
Converts an Analytical Link that is associative to a Curve Member or an edge of a Surface Member (known as a "shortest" Analytical Link) to an Analytical Link that is connected to a fixed coordinate.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the Analytical Link element.
api_analyticalLink | [out] The converted Analytical Link.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_CreateAnalyticalLoadCase()
 GSErrCode __ACENV_CALL ACAPI_Analytical_CreateAnalyticalLoadCase  |  ( |  API_AnalyticalLoadCase &  |  analyticalLoadCase | )
inline
Creates an Analytical Load Group.
Since
Archicad 26
Parameters
analyticalLoadCase | [in/out] The Load Case data to create the Load Case from. Initially if the guid field is given, we will use it at the time of creation (if does not already exist), otherwise we will generate one and return it through this parameter.
Returns
NoError - The function has completed with success.
Error - The creation was not successful (most probably due to already existing guid).
◆ ACAPI_Analytical_CreateAnalyticalLoadCombination()
 GSErrCode __ACENV_CALL ACAPI_Analytical_CreateAnalyticalLoadCombination  |  ( |  API_AnalyticalLoadCombination &  |  analyticalLoadCombination | )
inline
Creates an Analytical Load Combination.
Since
Archicad 26
Parameters
analyticalLoadCombination | [in/out] The Load Combination data to create the Load Combination from. Initially if the guid field is given, we will use it at the time of creation (if does not already exist), otherwise we will generate one and return it through this parameter.
Returns
NoError - The function has completed with success.
Error - The creation was not successful (most probably due to already existing guid).
◆ ACAPI_Analytical_CreateAnalyticalLoadGroup()
 GSErrCode __ACENV_CALL ACAPI_Analytical_CreateAnalyticalLoadGroup  |  ( |  API_AnalyticalLoadGroup &  |  analyticalLoadGroup | )
inline
Creates an Analytical Load Group.
Since
Archicad 26
Parameters
analyticalLoadGroup | [in/out] The Load Group data to create the Load Group from. Initially if the guid field is given, we will use it at the time of creation (if does not already exist), otherwise we will generate one and return it through this parameter.
Returns
NoError - The function has completed with success.
Error - The creation was not successful (most probably due to already existing guid).
◆ ACAPI_Analytical_CreateElementFromCurveMember()
 GSErrCode __ACENV_CALL ACAPI_Analytical_CreateElementFromCurveMember  |  ( |  API_AnalyticalCurveMember &  |  api_curveMember,
|  const GS::Optional< GS::UniString > &  |  favoriteName
)
inline
Creates an element from the Structural Analytical Model Curve Member.
Since
Archicad 26
Parameters
api_curveMember | [in/out] The Curve Member to create the element from. After a successful creation, it is filled with the unique identifier of the created element.
favoriteName | [in] The name of the Favorite Element which contains the settings for the new element, otherwise the settings are taken from the element default.
Returns
NoError - The function has completed with success.
Remarks
The ProfileVectorImage parameter for Custom Profiles has been moved into API_AnalyticalCrossSection
◆ ACAPI_Analytical_CreateElementFromSegmentedSurfaceMember()
 GSErrCode __ACENV_CALL ACAPI_Analytical_CreateElementFromSegmentedSurfaceMember  |  ( |  GS::Array< API_AnalyticalSurfaceMember > &  |  api_surfaceMember,
|  const GS::Optional< GS::UniString > &  |  favoriteName,
|  API_ImportIdMappingType *  |  idMapping
)
inline
Creates an element from the Structural Analytical Model Surface Member segments.
Since
Archicad 26
Parameters
api_surfaceMember | [in/out] The Surface Member to create the element from. After a successful creation, the first segment from the array is filled with the unique identifier of the created element.
favoriteName | [in] The name of the Favorite Element which contains the settings for the new element, otherwise the settings are taken from the element default.
idMapping | [out] An optional parameter for the mapping between Segment Surface Member edge&vertex ID and generated Surface Element Member Part Reference.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_CreateElementFromSurfaceMember()
 GSErrCode __ACENV_CALL ACAPI_Analytical_CreateElementFromSurfaceMember  |  ( |  API_AnalyticalSurfaceMember &  |  api_surfaceMember,
|  const GS::Optional< GS::UniString > &  |  favoriteName,
|  API_ImportIdMappingType *  |  idMapping
)
inline
Creates an element from the Structural Analytical Model Surface Member.
Since
Archicad 26
Parameters
api_surfaceMember | [in/out] The Surface Member to create the element from. After a successful creation, it is filled with the unique identifier of the created element.
favoriteName | [in] The name of the Favorite Element which contains the settings for the new element, otherwise the settings are taken from the element default.
idMapping | [out] An optional paramter which stores the mapping table for the edges and vertices of the member.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_DeleteAnalyticalLoadCase()
 GSErrCode __ACENV_CALL ACAPI_Analytical_DeleteAnalyticalLoadCase  |  ( |  const API_Guid &  |  analyticalLoadCaseGuid | )
inline
Deletes an Analytical Load Group.
Since
Archicad 26
Parameters
analyticalLoadCaseGuid | [in] The unique identifier of the desired Load Case to be deleted.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_DeleteAnalyticalLoadCombination()
 GSErrCode __ACENV_CALL ACAPI_Analytical_DeleteAnalyticalLoadCombination  |  ( |  const API_Guid &  |  analyticalLoadCombinationGuid | )
inline
Deletes an Analytical Load Combination.
Since
Archicad 26
Parameters
analyticalLoadCombinationGuid | [in] The unique identifier of the desired Load Combination to be deleted.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_DeleteAnalyticalLoadGroup()
 GSErrCode __ACENV_CALL ACAPI_Analytical_DeleteAnalyticalLoadGroup  |  ( |  const API_Guid &  |  analyticalLoadGroupGuid | )
inline
Deletes an Analytical Load Group.
Since
Archicad 26
Parameters
analyticalLoadGroupGuid | [in] The unique identifier of the desired Load Group to be deleted.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAllAnalyticalLoadCases()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAllAnalyticalLoadCases  |  ( |  GS::Array< API_Guid > &  |  analyticalLoadCases | )
inline
Returns an array of unique identifiers of all the existing Load Cases from every Load Group.
Since
Archicad 26
Parameters
analyticalLoadCases | [out] Array of unique identifiers.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalLinkGeometry()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalLinkGeometry  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  API_AnalyticalLinkGeometry &  |  api_analyticalLinkGeometry
)
inline
Returns the Structural Analytical Link Geometry.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the internal Curve Element.
api_analyticalLinkGeometry | [out] The Structural Analytical Link geometry.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalLoadCase()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalLoadCase  |  ( |  const API_Guid &  |  analyticalLoadCaseGuid,
|  API_AnalyticalLoadCase &  |  analyticalLoadCase
)
inline
Returns the Load Case with the given unique identifier.
Since
Archicad 26
Parameters
analyticalLoadCaseGuid | [in] Unique identifier of the Load Case.
analyticalLoadCase | [out] The Structural Analytical Load Case.
Returns
NoError - The function has completed with success.
Error - There is no load case with the given unique identifier.
◆ ACAPI_Analytical_GetAnalyticalLoadCases()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalLoadCases  |  ( |  const API_Guid &  |  analyticalLoadGroupGuid,
|  GS::Array< API_Guid > &  |  analyticalLoadCases
)
inline
Returns an array of unique identifiers of the existing Load Cases from a Load Group.
Since
Archicad 26
Parameters
analyticalLoadGroupGuid | [in] The unique identifier of the Load Group.
analyticalLoadCases | [out] Array of unique identifiers.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalLoadCombination()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalLoadCombination  |  ( |  const API_Guid &  |  analyticalLoadCombinationGuid,
|  API_AnalyticalLoadCombination &  |  analyticalLoadCombination
)
inline
Returns the Load Combination with the given unique identifier.
Since
Archicad 26
Parameters
analyticalLoadCombinationGuid | [in] Unique identifier of the Load combination.
analyticalLoadCombination | [out] The Structural Analytical Load combination.
Returns
NoError - The function has completed with success.
Error - There is no load combination with the given unique identifier.
◆ ACAPI_Analytical_GetAnalyticalLoadCombinations()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalLoadCombinations  |  ( |  GS::Array< API_Guid > &  |  analyticalLoadCombinations | )
inline
Returns an array of unique identifiers of the existing Load Combinations.
Since
Archicad 26
Parameters
analyticalLoadCombinations | [out] Array of unique identifiers.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalLoadGroup()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalLoadGroup  |  ( |  const API_Guid &  |  analyticalLoadGroupGuid,
|  API_AnalyticalLoadGroup &  |  analyticalLoadGroup
)
inline
Returns the Load Group with the given unique identifier.
Since
Archicad 26
Parameters
analyticalLoadGroupGuid | [in] Unique identifier of the Load Group.
analyticalLoadGroup | [out] The Structural Analytical Load Group.
Returns
NoError - The function has completed with success.
Error - There is no load group with the given unique identifier.
◆ ACAPI_Analytical_GetAnalyticalLoadGroups()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalLoadGroups  |  ( |  GS::Array< API_Guid > &  |  analyticalLoadGroups | )
inline
Returns an array of unique identifiers of the existing Load Groups.
Since
Archicad 26
Parameters
analyticalLoadGroups | [out] Array of unique identifiers.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalMemberConnections()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalMemberConnections  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  GS::HashSet< API_Guid > &  |  api_connections
)
inline
Returns the guids of elements which are connected to a Structural Analytical Member, given by it's guid. Includes elements which are connected by Structural Analytical Links.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the Structural Analytical Member.
api_connections | [out] The elements connected to the given Structural Analytical Member.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalMemberPartRefCoord()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalMemberPartRefCoord  |  ( |  const API_Guid &  |  amGuid,
|  const API_AnalyticalMemberPartRef &  |  api_memberPartRef,
|  API_AnalyticalNode &  |  api_analyticalNode
)
inline
Returns the coord of the given Structural Analytical Model's Analytical Member part if it identifies an edge.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
api_memberPartRef | [in] The member part ref of an analytical element.
api_analyticalNode | [out] The Structural Analytical Node.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalMemberPartRefCurve()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalMemberPartRefCurve  |  ( |  const API_Guid &  |  amGuid,
|  const API_AnalyticalMemberPartRef &  |  api_memberPartRef,
|  API_AnalyticalCurve &  |  api_analyticalCurve
)
inline
Returns the curve of the given Structural Analytical Model's Analytical Member part if it identifies a vertex.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
api_memberPartRef | [in] The member part ref of an analytical element.
api_analyticalCurve | [out] The Structural Analytical Model Curve.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalModel()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalModel  |  ( |  const API_AnalyticalModelVariation &  |  api_modelVariation,
|  API_Guid &  |  amGuid
)
inline
Returns the Structural Analytical Model created for the specified Model Variation.
Since
Archicad 26
Parameters
api_modelVariation | [in] The Model Variation specification.
amGuid | [out] The unique identifier for the Structural Analytical Model created for the specified Model Variation.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalModelVariation()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalModelVariation  |  ( |  const API_Guid &  |  amGuid,
|  API_AnalyticalModelVariation &  |  api_modelVariation
)
inline
Returns the Model Variation used for creating the specified Structural Analytical Model.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the Structural Analytical Model.
api_modelVariation | [out] The Model Variation specification.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalPointLoadGeometry()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalPointLoadGeometry  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  API_AnalyticalPointLoadGeometry &  |  api_analyticalPointLoadGeometry
)
inline
Returns the Structural Analytical Point Load Geometry.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the internal Curve Element.
api_analyticalPointLoadGeometry | [out] The Structural Analytical Point Load geometry.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalRelease()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalRelease  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  API_AnalyticalReleaseType &  |  api_analyticalRelease
)
inline
Returns the Structural Analytical Model Member Relase associated with the selected Curve Element.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the internal Curve Element.
api_analyticalRelease | [out] The Structural Analytical Model Member Release data.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetAnalyticalSupportGeometry()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetAnalyticalSupportGeometry  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  API_AnalyticalSupportGeometry &  |  api_analyticalSupportGeometry
)
inline
Returns the Structural AnalyticalSupport Geometry.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the internal Curve Element.
api_analyticalSupportGeometry | [out] The Structural Analytical Support geometry.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetComplementaryProjectMemberType()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetComplementaryProjectMemberType  |  ( |  const API_Guid &  |  elemGuid,
|  API_AnalyticalMemberType &  |  analyticalMemberType
)
inline
Returns the Analytical Member Type of a certain element from the Complementary Project.
Since
Archicad 26
Parameters
elemGuid | [in] The unique identifier of the Analytical Member element.
analyticalMemberType | [out] The type of the Analytical Member element from the Complementary Project.
Returns
NoError - The function has completed with success.
Remarks
It is recommended to call this function before creating any Analytical Member and use its analyticalMemberType value if it is different than API_AnalyticalMember_UnknownType.
◆ ACAPI_Analytical_GetCurrentAnalyticalModel()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetCurrentAnalyticalModel  |  ( |  API_Guid &  |  amGuid | )
inline
Returns the Structural Analytical Model created for the current view.
Since
Archicad 26
Parameters
amGuid | [out] The unique identifier of the internal Structural Analytical Model.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetCurveElements()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetCurveElements  |  ( |  const API_Guid &  |  amGuid,
|  GS::Array< API_Guid > &  |  curveElements
)
inline
Returns the elements that have Structural Analytical Model Curve Member associated.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
curveElements | [out] The list of Curve Element unique identifiers.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetCurveMember()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetCurveMember  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  API_AnalyticalCurveMember &  |  cm
)
inline
Returns the Structural Analytical Model Curve Member associated with the selected Curve Element.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the internal Curve Element.
cm | [out] The Structural Analytical Model Curve Member data.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetEdgeLoadFromElement()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetEdgeLoadFromElement  |  ( |  const API_Element &  |  element,
|  API_AnalyticalEdgeLoadType &  |  edgeLoad
)
inline
Obtains the API_AnalyticalEdgeLoadType from element , if it is a valid API_AnalyticalEdgeLoadType .
Since
Archicad 26
Parameters
element | [in] The source for the edgeLoad.
edgeLoad | [out] The edgeLoad to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetEdgeLoadGeometry()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetEdgeLoadGeometry  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  API_EdgeLoadCustomData &  |  edgeLoadCustomData
)
inline
Returns the Structural Analytical Model's Analytical Edge Load Geometry.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the Structural Analytical Member.
edgeLoadCustomData | [out] The Analytical Edge Load Geometry.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetLCSOfAnalyticalMember()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetLCSOfAnalyticalMember  |  ( |  const API_AnalyticalMemberPartRef &  |  analyticalMemberPartRef,
|  API_CoordinateSystem &  |  coordinateSystem
)
inline
Get the local coordinate system of a member from AnalyticalMemberPartRef.
Since
Archicad 26
Parameters
analyticalMemberPartRef | [in] The member part ref of an analytical element.
coordinateSystem | [out] Local coordinate system of the member
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetLCSOfAnalyticalMemberInIntersection()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetLCSOfAnalyticalMemberInIntersection  |  ( |  const API_AnalyticalMemberPartRef &  |  firstAnalyticalMemberPartRef,
|  const API_AnalyticalMemberPartRef &  |  secondAnalyticalMemberPartRef,
|  API_CoordinateSystem &  |  coordinateSystem
)
inline
Get the local coordinate system of a member in intersection of AnalyticalMemberPartRefs.
Since
Archicad 26
Parameters
firstAnalyticalMemberPartRef | [in] The member part ref of an analytical element.
secondAnalyticalMemberPartRef | [in] The member part ref of an analytical element.
coordinateSystem | [out] Local coordinate system of the member
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetLinkFromElement()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetLinkFromElement  |  ( |  const API_Element &  |  element,
|  API_AnalyticalLinkType &  |  link
)
inline
Obtains the API_AnalyticalLinkType from.
Since
Archicad 26
Parameters
element | [in] The source for the link.
link | [out] The link to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetPointLoadFromElement()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetPointLoadFromElement  |  ( |  const API_Element &  |  element,
|  API_AnalyticalPointLoadType &  |  pointLoad
)
inline
Obtains the API_AnalyticalPointLoadType from element , if it is a valid API_AnalyticalPointLoadType .
Since
Archicad 26
Parameters
element | [in] The source for the pointLoad.
pointLoad | [out] The pointLoad to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetSegmentedSurfaceMember()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetSegmentedSurfaceMember  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  GS::Array< API_AnalyticalSurfaceMember > &  |  surfaceMember,
|  double  |  centralAngle,
|  API_ExportIdMappingType &  |  surfaceIdMapping
)
inline
Returns the Structural Analytical Model Surface Member segmented version associated with the selected Surface Element.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the internal Surface Element.
surfaceMember | [out] The array of Structural Analytical Model Surface Member segments representing the Structural Analytical Model Surface Member data.
centralAngle | [in] The angle of segmentation for curved walls given in degrees.
surfaceIdMapping | [out] The mapping between Surface Elements edge/vertex ID and segments edge/vertex IDs
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetSupportFromElement()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetSupportFromElement  |  ( |  const API_Element &  |  element,
|  API_AnalyticalSupportType &  |  support
)
inline
Obtains the API_AnalyticalSupportType from element , if it is a valid API_AnalyticalSupportType .
Since
Archicad 26
Parameters
element | [in] The source for the support.
support | [out] The support to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetSurfaceElements()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetSurfaceElements  |  ( |  const API_Guid &  |  amGuid,
|  GS::Array< API_Guid > &  |  surfaceElements
)
inline
Returns the elements that have Structural Analytical Model Surface Member associated.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
surfaceElements | [out] The list of Surface Element unique identifiers.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetSurfaceLoadFromElement()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetSurfaceLoadFromElement  |  ( |  const API_Element &  |  element,
|  API_AnalyticalSurfaceLoadType &  |  surfaceLoad
)
inline
Obtains the API_AnalyticalSurfaceLoadType from element , if it is a valid API_AnalyticalSurfaceLoadType .
Since
Archicad 26
Parameters
element | [in] The source for the surfaceLoad.
surfaceLoad | [out] The surfaceLoad to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetSurfaceLoadGeometry()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetSurfaceLoadGeometry  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  API_SurfaceLoadCustomData &  |  edgeLoadCustomData
)
inline
Returns the Structural Analytical Model's Custom Surface Coordinates for Surface Load.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the Structural Analytical Member.
edgeLoadCustomData | [out] The Custom Surface Coordinates for Surface Load.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetSurfaceMember()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetSurfaceMember  |  ( |  const API_Guid &  |  amGuid,
|  const API_Guid &  |  elemGuid,
|  API_AnalyticalSurfaceMember &  |  surfaceMember,
|  API_ExportIdMappingType &  |  idMapping
)
inline
Returns the Structural Analytical Model Surface Member associated with the selected Surface Element.
Since
Archicad 26
Parameters
amGuid | [in] The unique identifier of the internal Structural Analytical Model.
elemGuid | [in] The unique identifier of the internal Surface Element.
surfaceMember | [out] The Structural Analytical Model Surface Member data.
idMapping | [out] The mapping between support/link/release partID and member's edge/vertex.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_GetVisibilitySettings()
 GSErrCode __ACENV_CALL ACAPI_Analytical_GetVisibilitySettings  |  ( |  API_AM_VisibilitySettings &  |  api_am_visiblitySettings | )
inline
Returns the Visibility Settings of the analytical model.
Since
Archicad 26
Parameters
api_am_visiblitySettings | [out] The visibility settings of the analytical model.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetAnalyticalRelease()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetAnalyticalRelease  |  ( |  const API_Guid &  |  elemGuid,
|  const API_AnalyticalReleaseType &  |  api_analyticalRelease
)
inline
Sets the Structural Analytical Model Member Release to the selected Curve Element.
Since
Archicad 26
Parameters
elemGuid | [in] The unique identifier of the internal Curve Element.
api_analyticalRelease | [in] The Structural Analytical Model Member Release data.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetEdgeLoadCustomDataFromMemo()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetEdgeLoadCustomDataFromMemo  |  ( |  const API_ElementMemo &  |  memo,
|  API_EdgeLoadCustomData &  |  edgeLoadCustomData
)
inline
Get Structural Analytical Model's Analytical Edge Load Geometry from the given memo.
Since
Archicad 26
Parameters
memo | [in] Element memo.
edgeLoadCustomData | [out] The Analytical Edge Load Geometry.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetElementFromEdgeLoad()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetElementFromEdgeLoad  |  ( |  const API_AnalyticalEdgeLoadType &  |  edgeLoad,
|  API_Element &  |  element
)
inline
Sets element.type to API_AnalyticalEdgeLoadID , and element.externalElemData to edgeLoad .
Since
Archicad 26
Parameters
edgeLoad | [in] The source for the element.
element | [out] The element to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetElementFromLink()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetElementFromLink  |  ( |  const API_AnalyticalLinkType &  |  link,
|  API_Element &  |  element
)
inline
Sets element.type to API_AnalyticalLinkID , and element.externalElemData to link .
Since
Archicad 26
Parameters
link | [in] The source for the element.
element | [out] The element to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetElementFromPointLoad()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetElementFromPointLoad  |  ( |  const API_AnalyticalPointLoadType &  |  pointLoad,
|  API_Element &  |  element
)
inline
Sets element.type to API_AnalyticalPointLoadID , and element.externalElemData to pointLoad .
Since
Archicad 26
Parameters
pointLoad | [in] The source for the element.
element | [out] The element to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetElementFromSupport()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetElementFromSupport  |  ( |  const API_AnalyticalSupportType &  |  support,
|  API_Element &  |  element
)
inline
Sets element.type to API_AnalyticalSupportID , and element.externalElemData to support .
Since
Archicad 26
Parameters
support | [in] The source for the element.
element | [out] The element to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetElementFromSurfaceLoad()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetElementFromSurfaceLoad  |  ( |  const API_AnalyticalSurfaceLoadType &  |  surfaceLoad,
|  API_Element &  |  element
)
inline
Sets element.type to API_AnalyticalSurfaceLoadID , and element.externalElemData to surfaceLoad .
Since
Archicad 26
Parameters
surfaceLoad | [in] The source for the element.
element | [out] The element to be set.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetGenerationSettingsToNoRule()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetGenerationSettingsToNoRule  |  ( |   | )
inline
Sets the current analytical model's generation settings to no rules.
Since
Archicad 26
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetMemoFromEdgeLoadCustomData()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetMemoFromEdgeLoadCustomData  |  ( |  const API_EdgeLoadCustomData &  |  edgeLoadCustomData,
|  API_ElementMemo &  |  memo
)
inline
Set Structural Analytical Model's Analytical Edge Load Geometry in the given memo.
Since
Archicad 26
Parameters
edgeLoadCustomData | [in] The Analytical Edge Load Geometry.
memo | [out] Element memo.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetMemoFromSurfaceLoadCustomData()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetMemoFromSurfaceLoadCustomData  |  ( |  const API_SurfaceLoadCustomData &  |  customData,
|  API_ElementMemo &  |  memo
)
inline
Set Structural Analytical Model's Custom Surface Coordinates for Surface Load in the given memo.
Since
Archicad 26
Parameters
customData | [in] The Custom Surface Coordinates for Surface Load.
memo | [out] Element memo.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetSurfaceLoadCustomDataFromMemo()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetSurfaceLoadCustomDataFromMemo  |  ( |  const API_ElementMemo &  |  memo,
|  API_SurfaceLoadCustomData &  |  customData
)
inline
Get Structural Analytical Model's Custom Surface Coordinates for Surface Load from the given memo.
Since
Archicad 26
Parameters
memo | [in] Element memo.
customData | [out] The Custom Surface Coordinates for Surface Load.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_SetVisibilitySettings()
 GSErrCode __ACENV_CALL ACAPI_Analytical_SetVisibilitySettings  |  ( |  const API_AM_VisibilitySettings &  |  api_am_visiblitySettings | )
inline
Sets the Visibility Settings of the analytical model.
Since
Archicad 26
Parameters
api_am_visiblitySettings | [in] The visibility settings of the analytical model.
Returns
NoError - The function has completed with success.
◆ ACAPI_Analytical_UpdateAnalyticalModel()
 GSErrCode __ACENV_CALL ACAPI_Analytical_UpdateAnalyticalModel  |  ( |  const API_Guid &  |  amGuid | )
inline
Triggers an update of the Structural Analytical Model specified.
Since
Archicad 26
Parameters
amGuid | [in/out] The Structural Analytical Model identifier.
Returns
NoError - The function has completed with success.